exercises/exercise05/exercise05.tex
% Created 2025-06-24 Tue 20:06
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[table]{xcolor}
\usepackage[margin=0.9in,bmargin=1.0in,tmargin=1.0in]{geometry}
\usepackage{algorithm2e}
\usepackage{algorithm}
\usepackage{amsmath}
\usepackage{arydshln}
\usepackage{subcaption}
\newcommand{\point}[1]{\noindent \textbf{#1}}
\usepackage{hyperref}
\usepackage{csquotes}
\usepackage{graphicx}
\usepackage{bm}
\usepackage{subfig}
\usepackage[mla]{ellipsis}
\parindent = 0em
\setlength\parskip{.5\baselineskip}
\usepackage{pgf}
\usepackage{tikz}
\usetikzlibrary{shapes,arrows,automata,quotes}
\usepackage[latin1]{inputenc}
\usepackage{adjustbox}
\author{Prof. Rodrigo Ribeiro}
\date{24-06-2025}
\title{Exercício prático 05\\\medskip
\large BCC328 - Construção de Compiladores I}
\hypersetup{
 pdfauthor={Prof. Rodrigo Ribeiro},
 pdftitle={Exercício prático 05},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.1 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section*{Construção de um interpretador para a linguagem L2}
\label{sec:orgfd15ec3}

O objetivo desta atividade é a implementação de um interpretador para  a linguagem L2,
que adiciona escopos e variáveis imutáveis a L1.
\section*{A Linguagem L2}
\label{sec:orgce14ced}

A linguagem L2 consiste na extensão de L1 por permitir a definição de variáveis imutáveis
e de seu escopo de visibilidade:

\begin{verbatim}
def v := e in
   block
end
\end{verbatim}

A construção anterior define a variável \texttt{v} como um nome para a expressão \texttt{e} e esta variável
é visível dentro do escopo dos comandos representados por \texttt{block}. Como exemplo concreto,
considere o seguinte trecho de código:

\begin{verbatim}
def x := 1 in
  a := x + 1 ;
  print(a);
  def x := 5 in
    a := x - 1;
    print(a);
  end
  print(x);
end
\end{verbatim}

No trecho anterior temos que a variável \texttt{x} tem o valor \texttt{1} nos comandos
\begin{verbatim}
a := x + 1;
print(a);
\end{verbatim}
e o valor impresso pelo comando \texttt{print(a)} será 2.]

Em seguida, temos o bloco

\begin{verbatim}
def x := 5 in
  a := x - 1;
  print(a);
end
\end{verbatim}
no qual a variável \texttt{x} terá o valor 5 nos comandos
\begin{verbatim}
a := x - 1;
print(a);
\end{verbatim}
Dessa forma, o comando \texttt{print(a)} irá imprimir o valor 4 no console.
É importante notar que variáveis imutáveis tem o valor definido no
escopo de sua definição. Isso quer dizer que o comando \texttt{print(x)}
irá imprimir o valor 1, que é o definido para a varável \texttt{x} no escopo
deste comando.
\subsection*{Sintaxe da linguagem L2}
\label{sec:org52ac005}

A sintaxe da linguagem L1 é definida pela seguinte gramática livre de contexto:

\begin{array}{lcl}
P & \to  & B \\
B & \to  & S\, B\:|\:\lambda\\
S & \to  & v := E ; \\
  & \mid & read(E,v);\\
  & \mid & print(E); \\
  & \mid & def\:v := E\:in\:P\:end
E & \to  & n \\
  & \mid & v \\
  & \mid & s \\
  & \mid & E + E \\
  & \mid & E - E \\
  & \mid & E * E \\
  & \mid & E \ E \\
\end{array}

A gramática é formada por quatro variáveis: \(P,\,B,\,S\) e \(E\); e pelos seguintes tokens (símbolos do alfabeto):

\begin{itemize}
\item \(def\): inicia a declaração de uma variável imutável.

\item \(in\): marca o início do bloco de escopo de uma variável imutável.

\item \(end\): encerra o bloco de escopo de uma variável imutável.

\item \(v\): representam identificadores. O token de identificador segue as regras usuais presentes em linguagens de programação:
um identitificador começa com uma letra seguida de uma sequência de zero ou mais dígitos ou letras.

\item \(n\): representam constantes numéricas. No momento, vamos suportar apenas números inteiros (tanto positivos, quanto negativos).

\item \(s\): representam literais de strings. A linguagem L2 utiliza aspas duplas para delimitar literais de string.
\end{itemize}

A sintaxe abstrata de L2 é representada pelos seguintes tipos de dados:

\begin{verbatim}
data L2
  = L2 [S2]

data S2
  = Def Var E2 [S2]
  | LRead String Var
  | LPrint E2
  | LAssign Var E2

data E2
  = LVal Value
  | LVar Var
  | LAdd E2 E2
  | LMinus E2 E2
  | LMul E2 E2
  | LDiv E2 E2
\end{verbatim}

O tipo \texttt{L2} representa a variável P, \texttt{S2} denota a variável S e \texttt{E2} representa a
variável E  da gramática de L2.
\subsection*{Semântica de L2}
\label{sec:org9b1b6a7}

A semântica de L2 é exatamente a de L1 com novas regras para lidar com variáveis imutáveis.
Para isso, vamos introduzir um novo ambiente para armazenar os valores deste tipo de variável.
Vamos adotar a variável \(\varphi\) para representar esse ambiente de variáveis imutáveis.

Vamos modificar a regra de variável, para dar suporte a variáveis imutáveis. A notação
\(\varphi(v) = \bot\) denota que não há valor associado a variável v no ambiente \(\varphi\).

\begin{array}{c}
  \dfrac{\varphi(v) = \bot\,\,\,\,\,\sigma(v) = n}{\varphi ; \sigma ; v \Downarrow n}\\ \\
  \dfrac{\varphi(v) = n}{\varphi ; \sigma ; v \Downarrow n}\\ \\
\end{array}

A regra para lidar com definições de variáveis imutáveis é como se segue:

\begin{array}{c}
  \dfrac{\varphi ; \sigma ; e \Downarrow n\,\,\,\,\,\varphi' = \varphi[v \mapsto n]\,\,\,\,\varphi';\sigma ; B \Downarrow \sigma'}
        {\varphi ; \sigma ; def\,v:=e\,in\,B \Downarrow \varphi ; \sigma'}
\end{array}
\section*{Detalhes da entrega}
\label{sec:orgcdf1072}

\subsection*{O que deverá ser implementado}
\label{sec:org72d0591}

Você deverá implementar:

\begin{itemize}
\item Analisador léxico para L2.

\item Analisador sintático para L2.

\item Interpretador para L2.
\end{itemize}

A seguir, detalharemos a estrutura pré-definida do projeto para L2.
A primeira função \texttt{lexerOnly} deve realizar a análise léxica sobre o
arquivo de entrada e imprimir os tokens encontrados, como feito para a
implementação de L1, em exercícios anteriores.

\begin{verbatim}
lexerOnly :: FilePath -> IO ()
lexerOnly file = error "Not implemented!"
\end{verbatim}

A segunda função, \texttt{parserOnly}, deve realizar a análise sintática sobre o
arquivo de entrada e imprimir a árvores de sintaxe produzida, como feito para a
implementação de L1.

\begin{verbatim}
parserOnly :: FilePath -> IO ()
parserOnly file = error "Not implemented!"
\end{verbatim}

Finalmente, a última função, \texttt{interpret}, deve realizar a interpretação do programa
contido no arquivo fonte fornecido. Para isso, você deverá executar a análise léxica,
sintática e executar o programa representado pela árvore produzida pelo analisador
sintático de L2.

\begin{verbatim}
interpret :: FilePath -> IO ()
interpret file = error "Not implemented!"
\end{verbatim}

todas essa funções estão presentes no arquivo src/L2/L2.hs, que é o arquivo principal
para implementações da linguagem L2.
A implementação da árvore sintática para programas L2 está presente no arquivo \texttt{Syntax.hs}
na pasta L2.Frontend.
\subsection*{Como será feita a entrega}
\label{sec:orgfed70f8}

\begin{itemize}
\item As entregas serão feitas utilizando a plataforma Github classroom.
\end{itemize}
\end{document}
